Autodesk.Revit.DB.VerticalTextAlignment
Since:
2016
Supported types of vertical alignment of a text element.
Since:
2016

Autodesk.Revit.DB.VerticalTextAlignment.Middle
The horizontal center line of the text box remains in place as the height of the text changes.

Autodesk.Revit.DB.VerticalTextAlignment.Bottom
Bottom of the text box remains in place as the height of the text changes.

Autodesk.Revit.DB.VerticalTextAlignment.Top
Top of the text box remains in place as the height of the text changes.